      *******************************************************************
      * Author: Lucas Ramon
      * Date: 05/11/2024
      * Purpose: Printar 'Vasco da Gama e nada mais'
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG01.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Vasco da Gama e nada mais."
            STOP RUN.
       END PROGRAM PROG01.
